In [1]:
%LOAD sqlite3 db=../databases/imdb.db timeout=2 shared_cache=true

In [2]:
ATTACH "../databases/covid19.db" AS covid19;

In [3]:
ATTACH "../databases/nba.db" AS nba;

In [4]:
SELECT 5566 AS an_integer,
       2.718 AS a_real,
       'Hello, World!' AS a_text,
       NULL AS a_null;

+------------+--------+---------------+--------+
| an_integer | a_real | a_text        | a_null |
+------------+--------+---------------+--------+
| 5566       | 2.718  | Hello, World! | NULL   |
+------------+--------+---------------+--------+
1 row in set (0.00 sec)

In [5]:
SELECT TYPEOF(5566) AS typeof_an_integer,
       TYPEOF(2.718) AS typeof_a_real,
       TYPEOF('Hello, World!') AS typeof_a_text,
       TYPEOF(NULL) AS typeof_a_null;

+-------------------+---------------+---------------+---------------+
| typeof_an_integer | typeof_a_real | typeof_a_text | typeof_a_null |
+-------------------+---------------+---------------+---------------+
| integer           | real          | text          | null          |
+-------------------+---------------+---------------+---------------+
1 row in set (0.00 sec)

In [6]:
SELECT 55 + 66 AS add_two_integers,
       55 - 66 AS subtract_two_integers,
       55 * 66 AS multiply_two_integers,
       7 / 2 AS divide_two_integers,
       7 % 2 AS modulo;

+------------------+-----------------------+-----------------------+---------------------+--------+
| add_two_integers | subtract_two_integers | multiply_two_integers | divide_two_integers | modulo |
+------------------+-----------------------+-----------------------+---------------------+--------+
| 121              | -11                   | 3630                  | 3                   | 1      |
+------------------+-----------------------+-----------------------+---------------------+--------+
1 row in set (0.00 sec)

In [7]:
SELECT 7 / 2 AS divide_two_integers,
       7 * 1.0 / 2 AS divide_real,
       7 / 2 * 1.0 AS divide_integer; -- be aware of the priority of operation

+---------------------+-------------+----------------+
| divide_two_integers | divide_real | divide_integer |
+---------------------+-------------+----------------+
| 3                   | 3.5         | 3.0            |
+---------------------+-------------+----------------+
1 row in set (0.00 sec)

In [8]:
SELECT runtime,
       runtime / 60 AS hours,
       runtime % 60 AS minutes
  FROM movies
 LIMIT 5;

+---------+-------+---------+
| runtime | hours | minutes |
+---------+-------+---------+
| 142     | 2     | 22      |
+---------+-------+---------+
| 175     | 2     | 55      |
+---------+-------+---------+
| 152     | 2     | 32      |
+---------+-------+---------+
| 202     | 3     | 22      |
+---------+-------+---------+
| 96      | 1     | 36      |
+---------+-------+---------+
5 rows in set (0.00 sec)

In [9]:
SELECT 'Tony' AS first_name,
       'Stark' AS last_name,
       'Tony' || ' ' || 'Stark' AS ironman;

+------------+-----------+------------+
| first_name | last_name | ironman    |
+------------+-----------+------------+
| Tony       | Stark     | Tony Stark |
+------------+-----------+------------+
1 row in set (0.00 sec)

In [10]:
SELECT runtime,
       (runtime / 60) || ' hours ' || (runtime % 60) || ' minutes' AS hours_minutes
  FROM movies
 LIMIT 5;

+---------+--------------------+
| runtime | hours_minutes      |
+---------+--------------------+
| 142     | 2 hours 22 minutes |
+---------+--------------------+
| 175     | 2 hours 55 minutes |
+---------+--------------------+
| 152     | 2 hours 32 minutes |
+---------+--------------------+
| 202     | 3 hours 22 minutes |
+---------+--------------------+
| 96      | 1 hours 36 minutes |
+---------+--------------------+
5 rows in set (0.00 sec)

In [11]:
SELECT runtime / 60 AS hours,
       TYPEOF(runtime / 60) AS typeof_hours,
       CAST(runtime / 60 AS text) AS hours_text,               -- convert datatype explicitly
       TYPEOF(CAST(runtime / 60 AS text)) AS typeof_hours_text -- check datatype conversion
  FROM movies
 LIMIT 5;

+-------+--------------+------------+-------------------+
| hours | typeof_hours | hours_text | typeof_hours_text |
+-------+--------------+------------+-------------------+
| 2     | integer      | 2          | text              |
+-------+--------------+------------+-------------------+
| 2     | integer      | 2          | text              |
+-------+--------------+------------+-------------------+
| 2     | integer      | 2          | text              |
+-------+--------------+------------+-------------------+
| 3     | integer      | 3          | text              |
+-------+--------------+------------+-------------------+
| 1     | integer      | 1          | text              |
+-------+--------------+------------+-------------------+
5 rows in set (0.00 sec)

In [12]:
SELECT 55 = 66 AS False,
       55 != 66 AS True,
       55 > 55 AS False,
       55 >= 55 AS True,
       66 < 66 AS False,
       66 <= 66 AS True,
       'Apple' LIKE 'A%' AS True,
       'Banana' LIKE 'A%' AS False,
       'A' IN ('A', 'B', 'C') AS True,
       59 BETWEEN 55 AND 66 AS True,
       NULL IS NULL AS True;

+-------+------+-------+------+-------+------+------+-------+------+------+------+
| False | True | False | True | False | True | True | False | True | True | True |
+-------+------+-------+------+-------+------+------+-------+------+------+------+
| 0     | 1    | 0     | 1    | 0     | 1    | 1    | 0     | 1    | 1    | 1    |
+-------+------+-------+------+-------+------+------+-------+------+------+------+
1 row in set (0.00 sec)

In [13]:
SELECT rating >= 9 AS rating_is_high,
       director == 'Steven Spielberg' AS is_directed_by_steven_spielberg,
       title IN ('The Shawshank Redemption', 'The Dark Knight') AS is_specific_movie
  FROM movies
 LIMIT 10;

+----------------+---------------------------------+-------------------+
| rating_is_high | is_directed_by_steven_spielberg | is_specific_movie |
+----------------+---------------------------------+-------------------+
| 1              | 0                               | 1                 |
+----------------+---------------------------------+-------------------+
| 1              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
| 1              | 0                               | 1                 |
+----------------+---------------------------------+-------------------+
| 1              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
| 1              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
| 1              | 1                               | 0                 |
+----------------+---------------------------------+-------------------+
| 1              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
| 0              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
| 0              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
| 0              | 0                               | 0                 |
+----------------+---------------------------------+-------------------+
10 rows in set (0.00 sec)

In [14]:
SELECT 0 AND 0 AS False,
       0 AND 1 AS False,
       1 AND 1 AS True,
       0 OR 0 AS False,
       0 OR 1 AS True,
       1 OR 1 AS True,
       'Apple' NOT LIKE 'A%' AS False,
       'Banana' NOT LIKE 'A%' AS True,
       'A' NOT IN ('A', 'B', 'C') AS False,
       59 NOT BETWEEN 55 AND 66 AS False,
       NULL IS NOT NULL AS False;

+-------+-------+------+-------+------+------+-------+------+-------+-------+-------+
| False | False | True | False | True | True | False | True | False | False | False |
+-------+-------+------+-------+------+------+-------+------+-------+-------+-------+
| 0     | 0     | 1    | 0     | 1    | 1    | 0     | 1    | 0     | 0     | 0     |
+-------+-------+------+-------+------+------+-------+------+-------+-------+-------+
1 row in set (0.00 sec)

In [15]:
SELECT rating >= 9 AND release_year < 2000 AS rating_is_high_and_released_before_millennium,
       director == 'Steven Spielberg' OR
       director == 'Christopher Nolan' AS is_directed_by_steven_spielberg_or_christopher_nolan,
       title == 'The Shawshank Redemption' OR
       title == 'The Dark Knight' AS is_specific_movie
  FROM movies
 LIMIT 10;

+-----------------------------------------------+------------------------------------------------------+-------------------+
| rating_is_high_and_released_before_millennium | is_directed_by_steven_spielberg_or_christopher_nolan | is_specific_movie |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 1                                             | 0                                                    | 1                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 1                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 0                                             | 1                                                    | 1                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 1                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 1                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 1                                             | 1                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 0                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 0                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 0                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
| 0                                             | 0                                                    | 0                 |
+-----------------------------------------------+------------------------------------------------------+-------------------+
10 rows in set (0.00 sec)

# Exercise

In [17]:
SELECT Confirmed, Deaths,
       Deaths*1.0 / Confirmed AS Fatality_Ratio
  FROM covid19.daily_report
 LIMIT 5;

+-----------+--------+---------------------+
| Confirmed | Deaths | Fatality_Ratio      |
+-----------+--------+---------------------+
| 180347    | 7705   | 0.0427231947301591  |
+-----------+--------+---------------------+
| 276101    | 3497   | 0.0126656549595981  |
+-----------+--------+---------------------+
| 265884    | 6875   | 0.0258571407079779  |
+-----------+--------+---------------------+
| 42894     | 153    | 0.00356693243810323 |
+-----------+--------+---------------------+
| 99761     | 1900   | 0.0190455187899079  |
+-----------+--------+---------------------+
5 rows in set (0.00 sec)

In [19]:
SELECT heightMeters, weightKilograms,
       weightKilograms / (heightMeters * heightMeters) AS bmi
  FROM nba.players
 LIMIT 5;

+--------------+-----------------+------------------+
| heightMeters | weightKilograms | bmi              |
+--------------+-----------------+------------------+
| 2.06         | 113.4           | 26.7225940239419 |
+--------------+-----------------+------------------+
| 2.01         | 108             | 26.7320115838717 |
+--------------+-----------------+------------------+
| 2.03         | 106.6           | 25.8681356014463 |
+--------------+-----------------+------------------+
| 2.08         | 120.2           | 27.7829142011834 |
+--------------+-----------------+------------------+
| 1.98         | 97.5            | 24.8699112335476 |
+--------------+-----------------+------------------+
5 rows in set (0.00 sec)

In [ ]:
-- sqlite 沒有很多內建function，但可以自己建

In [30]:
SELECT heightMeters, weightKilograms,
       weightKilograms / pow(heightMeters, 2) AS bmi
  FROM nba.players
 LIMIT 5;

Error: sqlite3_statement_backend::prepare: no such function: pow while preparing "SELECT heightMeters, weightKilograms,
       weightKilograms / pow(heightMeters, 2) AS bmi
  FROM nba.players
 LIMIT 5;".

In [28]:
SELECT DISTINCT confName || ', ' || divName AS conf_div
FROM nba.teams

+-----------------+
| conf_div        |
+-----------------+
| East, Southeast |
+-----------------+
| East, Atlantic  |
+-----------------+
| East, Central   |
+-----------------+
| West, Southwest |
+-----------------+
| West, Northwest |
+-----------------+
| West, Pacific   |
+-----------------+
6 rows in set (0.00 sec)